app/Http/Controllers/PostController.php

select * from `users` where `users`.`id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20)
---
    public function show(Post $post)
    {
//        $post->load('comment.user', 'comment.post.comment');

        $post->load('comment.user');
        $post->comment->each->setRelation('post', $post);