app/Http/Controllers/UserController.php

    public function index()
    {
        $users = User::query()
            ->with('company')
            ->search(request('search'))
            ->paginate();
---
select * from `companies` where `companies`.`id` in (5, 72, 95, 158, 175, 243, 370, 399, 483, 544, 631, 713, 733, 779, 994)
select * from `users` limit 16 offset 15