app/Http/Controllers/UserController.php

select * from `users` order by `name` asc limit 16 offset 15
---
    public function index()
    {
//        $users = User::query()
//            ->orderBy('name')
//            ->paginate();

//        --------------------------------------------------------------------------------------------------------------

        $users = User::query()
            ->when(request('sort') === 'town', function ($query) {
                $query->orderByRaw('town is null')
                    ->orderBY('town', request('direction'));
            })
            ->orderBy('name')
            ->paginate();